import pandas as pd

###Упражнение
# 1. Рассчитать по каждой паре «регион — категория» число продаж, среднее и медиану.
# 2. Через `transform()` добавить каждой продаже среднее значение её группы.
# 3. Найти наблюдения выше группового среднего.
# 4. Объяснить, почему результат `agg()` нельзя без дополнительного сопоставления использовать как построчный столбец исходной таблицы.

sales = pd.DataFrame({
    "region": [
        "Север", "Север", "Север", "Север", "Север", "Север",
        "Юг", "Юг", "Юг", "Юг", "Юг", "Юг",
        "Запад", "Запад", "Запад", "Запад", "Запад", "Запад"
    ],
    "category": [
        "Электроника", "Электроника", "Электроника",
        "Одежда", "Одежда", "Одежда",
        "Электроника", "Электроника", "Электроника",
        "Одежда", "Одежда", "Одежда",
        "Электроника", "Электроника", "Электроника",
        "Одежда", "Одежда", "Одежда"
    ],
    "sales": [
        12000, 18000, 24000,
        5000, 8000, 11000,
        15000, 21000, 33000,
        6000, 9000, 15000,
        10000, 14000, 18000,
        7000, 10000, 19000
    ]
})

grouped_sales = sales.groupby(by=["region", "category"], as_index=False)
summary = grouped_sales.agg(sum_of_sales = ("sales", "sum"), average_sales = ("sales", "mean"), median_sales = ("sales", "median"))
print(summary)

sales["mean_sales"] = grouped_sales["sales"].transform("mean")
print(sales)
print()
print(sales.query("sales > mean_sales"))
print()